modm-ext/archive-stmicro-svd/rm_rm0433_stm32h742agi6.svd
      <register>
        <name>QMEM3.4</name>
        <addressOffset>0x120</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.5</name>
        <addressOffset>0x124</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.6</name>
        <addressOffset>0x128</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.7</name>
        <addressOffset>0x12c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.8</name>
        <addressOffset>0x130</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.9</name>
        <addressOffset>0x134</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.10</name>
        <addressOffset>0x138</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.11</name>
        <addressOffset>0x13c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.12</name>
        <addressOffset>0x140</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.13</name>
        <addressOffset>0x144</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.14</name>
        <addressOffset>0x148</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>QMEM3.15</name>
        <addressOffset>0x14c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.0</name>
        <addressOffset>0x150</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.1</name>
        <addressOffset>0x154</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.2</name>
        <addressOffset>0x158</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.3</name>
        <addressOffset>0x15c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.4</name>
        <addressOffset>0x160</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.5</name>
        <addressOffset>0x164</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.6</name>
        <addressOffset>0x168</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.7</name>
        <addressOffset>0x16c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.8</name>
        <addressOffset>0x170</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.9</name>
        <addressOffset>0x174</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.10</name>
        <addressOffset>0x178</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.11</name>
        <addressOffset>0x17c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.12</name>
        <addressOffset>0x180</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.13</name>
        <addressOffset>0x184</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.14</name>
        <addressOffset>0x188</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFMIN.15</name>
        <addressOffset>0x18c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.0</name>
        <addressOffset>0x190</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.1</name>
        <addressOffset>0x194</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.2</name>
        <addressOffset>0x198</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.3</name>
        <addressOffset>0x19c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.4</name>
        <addressOffset>0x1a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.5</name>
        <addressOffset>0x1a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.6</name>
        <addressOffset>0x1a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.7</name>
        <addressOffset>0x1ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.8</name>
        <addressOffset>0x1b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.9</name>
        <addressOffset>0x1b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.10</name>
        <addressOffset>0x1b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.11</name>
        <addressOffset>0x1bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.12</name>
        <addressOffset>0x1c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.13</name>
        <addressOffset>0x1c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.14</name>
        <addressOffset>0x1c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.15</name>
        <addressOffset>0x1cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.16</name>
        <addressOffset>0x1d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.17</name>
        <addressOffset>0x1d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.18</name>
        <addressOffset>0x1d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.19</name>
        <addressOffset>0x1dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.20</name>
        <addressOffset>0x1e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.21</name>
        <addressOffset>0x1e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.22</name>
        <addressOffset>0x1e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.23</name>
        <addressOffset>0x1ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.24</name>
        <addressOffset>0x1f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.25</name>
        <addressOffset>0x1f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.26</name>
        <addressOffset>0x1f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.27</name>
        <addressOffset>0x1fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.28</name>
        <addressOffset>0x200</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.29</name>
        <addressOffset>0x204</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.30</name>
        <addressOffset>0x208</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFBASE.31</name>
        <addressOffset>0x20c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.0</name>
        <addressOffset>0x210</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.1</name>
        <addressOffset>0x214</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.2</name>
        <addressOffset>0x218</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.3</name>
        <addressOffset>0x21c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.4</name>
        <addressOffset>0x220</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.5</name>
        <addressOffset>0x224</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.6</name>
        <addressOffset>0x228</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.7</name>
        <addressOffset>0x22c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.8</name>
        <addressOffset>0x230</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.9</name>
        <addressOffset>0x234</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.10</name>
        <addressOffset>0x238</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.11</name>
        <addressOffset>0x23c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.12</name>
        <addressOffset>0x240</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.13</name>
        <addressOffset>0x244</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.14</name>
        <addressOffset>0x248</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.15</name>
        <addressOffset>0x24c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.16</name>
        <addressOffset>0x250</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.17</name>
        <addressOffset>0x254</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.18</name>
        <addressOffset>0x258</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.19</name>
        <addressOffset>0x25c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.20</name>
        <addressOffset>0x260</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.21</name>
        <addressOffset>0x264</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.22</name>
        <addressOffset>0x268</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.23</name>
        <addressOffset>0x26c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.24</name>
        <addressOffset>0x270</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.25</name>
        <addressOffset>0x274</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.26</name>
        <addressOffset>0x278</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.27</name>
        <addressOffset>0x27c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.28</name>
        <addressOffset>0x280</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.29</name>
        <addressOffset>0x284</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.30</name>
        <addressOffset>0x288</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.31</name>
        <addressOffset>0x28c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.32</name>
        <addressOffset>0x290</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.33</name>
        <addressOffset>0x294</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.34</name>
        <addressOffset>0x298</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.35</name>
        <addressOffset>0x29c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.36</name>
        <addressOffset>0x2a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.37</name>
        <addressOffset>0x2a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.38</name>
        <addressOffset>0x2a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.39</name>
        <addressOffset>0x2ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.40</name>
        <addressOffset>0x2b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.41</name>
        <addressOffset>0x2b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.42</name>
        <addressOffset>0x2b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.43</name>
        <addressOffset>0x2bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.44</name>
        <addressOffset>0x2c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.45</name>
        <addressOffset>0x2c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.46</name>
        <addressOffset>0x2c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.47</name>
        <addressOffset>0x2cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.48</name>
        <addressOffset>0x2d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.49</name>
        <addressOffset>0x2d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.50</name>
        <addressOffset>0x2d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.51</name>
        <addressOffset>0x2dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.52</name>
        <addressOffset>0x2e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.53</name>
        <addressOffset>0x2e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.54</name>
        <addressOffset>0x2e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.55</name>
        <addressOffset>0x2ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.56</name>
        <addressOffset>0x2f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.57</name>
        <addressOffset>0x2f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.58</name>
        <addressOffset>0x2f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.59</name>
        <addressOffset>0x2fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.60</name>
        <addressOffset>0x300</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.61</name>
        <addressOffset>0x304</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.62</name>
        <addressOffset>0x308</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.63</name>
        <addressOffset>0x30c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.64</name>
        <addressOffset>0x310</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.65</name>
        <addressOffset>0x314</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.66</name>
        <addressOffset>0x318</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.67</name>
        <addressOffset>0x31c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.68</name>
        <addressOffset>0x320</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.69</name>
        <addressOffset>0x324</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.70</name>
        <addressOffset>0x328</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.71</name>
        <addressOffset>0x32c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.72</name>
        <addressOffset>0x330</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.73</name>
        <addressOffset>0x334</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.74</name>
        <addressOffset>0x338</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.75</name>
        <addressOffset>0x33c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.76</name>
        <addressOffset>0x340</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.77</name>
        <addressOffset>0x344</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.78</name>
        <addressOffset>0x348</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.79</name>
        <addressOffset>0x34c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.80</name>
        <addressOffset>0x350</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.81</name>
        <addressOffset>0x354</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.82</name>
        <addressOffset>0x358</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>HUFFSYMB.83</name>
        <addressOffset>0x35c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.0</name>
        <addressOffset>0x360</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.1</name>
        <addressOffset>0x364</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.2</name>
        <addressOffset>0x368</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.3</name>
        <addressOffset>0x36c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.4</name>
        <addressOffset>0x370</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.5</name>
        <addressOffset>0x374</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.6</name>
        <addressOffset>0x378</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.7</name>
        <addressOffset>0x37c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.8</name>
        <addressOffset>0x380</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.9</name>
        <addressOffset>0x384</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.10</name>
        <addressOffset>0x388</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.11</name>
        <addressOffset>0x38c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.12</name>
        <addressOffset>0x390</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.13</name>
        <addressOffset>0x394</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.14</name>
        <addressOffset>0x398</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.15</name>
        <addressOffset>0x39c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.16</name>
        <addressOffset>0x3a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.17</name>
        <addressOffset>0x3a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.18</name>
        <addressOffset>0x3a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.19</name>
        <addressOffset>0x3ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.20</name>
        <addressOffset>0x3b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.21</name>
        <addressOffset>0x3b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.22</name>
        <addressOffset>0x3b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.23</name>
        <addressOffset>0x3bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.24</name>
        <addressOffset>0x3c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.25</name>
        <addressOffset>0x3c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.26</name>
        <addressOffset>0x3c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.27</name>
        <addressOffset>0x3cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>DHTMEM.28</name>
        <addressOffset>0x3d0</addressOffset>
        <size>0x20</size>
      </register>
